{
	"000_prologue": {
		"title": "Prologue",
		"picture": "res://assets/art/Ancient_Forest_Eldoria.jpg",
		"narr_text": "I came to with the taste of blood and dirt on my tongue, breath scraping through my throat like a rusted hinge. Each inhale felt borrowed,",
		"choices": {
			"1": {
				"text": "Continue.",
				"output": "000_prologue_c1",
			}
		}
	},
	"000_prologue_c1": {
		"title": "",
		"picture": "res://assets/art/Ancient_Forest_Eldoria.jpg",
		"narr_text": "My limited vision swam in a haze—ancient trees loomed above like silent sentinels, it was bright... a bright sky blue enveloped me. and as my muscle struggled as I raised my head to the sky, the smudges that could only be stars blinked cold and distant, watching but offering no comfort.",
		"choices": {
			"1": {
				"text": "Focus on my name.",
				"output": "000_prologue_2",
			},
			"2": {
				"text": "Take in the surroundings.",
				"output": "000_prologue_3"
			}
		}
	},
	"000_prologue_2": {
		"title": "",
		"picture": "res://assets/art/Ancient_Forest_Eldoria.jpg",
		"narr_text": "My name is Lyaris Alaric Talbot... I think.",
		"choices": {
			"1": {
				"text": "Continue",
				"output": "000_prologue_2_c1"
			}
		}
	},
	"000_prologue_2_c1": {
		"title": "",
		"picture": "res://assets/art/Ancient_Forest_Eldoria.jpg",
		"narr_text": "Who am I? What am I doing here? The answers slip through my grasp, my thoughts scattered like leaves in the wind.",
		"choices": {
			"1": {
				"text": "Try to remember more.",
				"output": "000_prologue_4"
			}
		}
	},
	"000_prologue_3": {
		"title": "",
		"picture": "res://assets/art/Ancient_Forest_Eldoria.jpg",
		"narr_text": "My muscles screamed with every breath, the pain buried deep, as if each fibre had been torn and reknit by barbed wire as surgical tools. Moving was agony—but I moved all the same. Through grit and groaning will, I brought myself to my knees. \n\nThe forest loomed in silence. Ancient. Watchful...",
		"choices": {
			"1": {
				"text": "Continue.",
				"output": "000_prologue_3_c1"
			}
		}
	},
	"000_prologue_3_c1": {
		"title": "",
		"picture": "res://assets/art/Ancient_Forest_Eldoria.jpg",
		"narr_text": "The air hung heavy with the scent of damp earth and rot, thick as a burial shroud. Every breath tasted of soil and time. Then—somewhere in the distance—a howl. Long, low, and full of hunger. It tore through the stillness like a blade. \n\nThe sound gripped my spine like a cold hand, pulling me upright despite the pain. I rose, trembling—not from strength, but from fear.",
		"choices": {
			"1": {
				"text": "Continue.",
				"output": "000_prologue_2"
			},
			"2": {
				"text": "Think about what happened to me.",
				"output": "000_prologue_4"
			}
		}
	},

	"000_prologue_4": {
		"title": "",
		"picture": "res://assets/art/Ancient_Forest_Eldoria.jpg",
		"narr_text": "Just then, images struck like lightning behind my eyes—fleeting, cruel, and unwelcome. An agreement... yes, with others. Adventurers, I think. The word feels wrong on my tongue now, but it fit once. I remember the flutter of excitement, dulled by a shadow of doubt I never voiced. \n\nGold was promised—whispered like a secret, bartered not in open sun, but in the corners where light dares not linger. The journey blurs—long, arduous, filled with laughter and tension, campfire smoke and the hush of danger. Weeks, perhaps. \n\nThen came the dark. And monsters. Real or imagined, I cannot say. Laughter followed me there too—sharp, cruel, like a dagger twisted for amusement. Faces rise from the fog of my memory, but their names do not follow. Only their ugliness, the betrayal etched in their eyes. And then—pain... Cold steel, sure and deliberate, cutting through trust as easily as it split my flesh. And after that... a light. Blinding...",
		"choices": {
			"1": {
				"text": "Continue",
				"output": "000_prologue_4_c1"
			}
		}
	},
		"000_prologue_4_c1": {
		"title": "",
		"picture": "res://assets/art/Ancient_Forest_Eldoria.jpg",
		"narr_text": "His voice cracked the silence like dry bark splitting under great pressure. 'They left me...' he rasped, the words barely more than a whisper torn from a throat scoured raw by thirst and dust.",
		"choices": {
			"1": {
				"text": "Examine my body for injuries.",
				"output": "000_prologue_5"
			}
		}
	},


	"000_prologue_5": {
		"title": "Prologue: The Mark",
		"picture": "res://assets/art/Ancient_Forest_Eldoria.jpg",
		"narr_text": "A pause 'Abandoned... to this gods-forsaken wild...' another pause, then a bitter bark of laughter that turned to coughing—wracking, violent, as if his lungs had forgotten the shape of breath. 'Why?' he gasped, the sound ragged, pleading. 'Why—' Another fit seized him, hacking and gasping until his knees buckled and the forest floor caught him in its cold embrace. \n\nHe clutched his chest but could only feel the cold chestplate he had on, wide-eyed, as though only now realizing he hadn’t truly breathed since he’d woken. His body trembled.",
		"choices": {
			"1": {
				"text": "Continue",
				"output": "000_prologue_5_c1"
			},
		}
	},


	"000_prologue_5_c1": {
		"title": "",
		"picture": "res://assets/art/Ancient_Forest_Eldoria.jpg",
		"narr_text": "It was as if every muscle in my body had once been torn apart and stitched back together with fire. The pain lingered, a dull throb beneath my skin, but it had lessened since I first woke... except one limb.",
		"choices": {
			"1": {
				"text": "Continue",
				"output": "000_prologue_5_c2"
			},
		}
	},


	"000_prologue_5_c2": {
		"title": "",
		"picture": "res://assets/art/Ancient_Forest_Eldoria.jpg",
		"narr_text": "Beneath my skin, something burns—an unholy heat that writhes like molten iron coursing through my veins. It is not the fire of fever, but of something older, crueler. The pain is dull, constant, like a forge left simmering long after the smith has gone.",
		"choices": {
			"1": {
				"text": "Continue",
				"output": "000_prologue_5_c3"
			},
		}
	},

	"000_prologue_5_c3": {
		"title": "",
		"picture": "res://assets/art/Ancient_Forest_Eldoria.jpg",
		"narr_text": "My hand trembles as I lift the tattered remnants of cloth clinging to my frame. There, etched into the pallor of my skin, is a mark—no wound, no scar, but something older. like a tattoo. It glows faintly, the color of a cloudless sky, cold. It feels wrong...",
		"choices": {
			"1": {
				"text": "Panic and try to suppress it.",
				"output": "000_prologue_6"
			},
			"2": {
				"text": "Accept the mark and move on.",
				"output": "001_intro"
			}
		}
	},
	"000_prologue_6": {
		"title": "",
		"picture": "res://assets/art/Ancient_Forest_Eldoria.jpg",
		"narr_text": "I grip my wrist tightly, as if I could hold the chaos in place. My breathing quickens, the glow intensifying for a moment before it settles. I could tell that This Mark... it saved me, didn’t it? I'm not...",
		"choices": {
			"1": {
				"text": "Move forward cautiously.",
				"output": "001_intro"
			}
		}
	},
	"001_intro": {
		"title": "",
		"picture": "res://assets/art/Forest_Path.jpg",
		"narr_text": "The forest is alive with sounds—howls that pierce the night, rustling leaves that hint at unseen predators. I stagger to my feet, my body screaming in protest. I have nothing but my will and this cursed mark. Somewhere in the distance, I see the very faint glow of torches. A village, perhaps? Or bandits. Either way, it’s a chance I have to take.",
		"choices": {
			"1": {
				"text": "Head toward the lights, hoping for sanctuary.",
				"output": "001_wandering_1"
			},
			"2": {
				"text": "Avoid the lights and try to scavenge in the wilderness.",
				"output": "001_wandering_1"
			}
		}
	},
	"001_wandering_1": {
		"title": "",
		"picture": "res://assets/art/Dark_Forest.jpg",
		"narr_text": "As my weak dragging turns into defined steps as the minutes pass. The ground crunches underfoot, the sound unnaturally loud in the oppressive silence. Each step feels like a question I can't answer. \n\nMy memories flicker like distant lanterns—there, but too far to grasp. I push forward, guided by nothing but the hope that movement itself will lead me somewhere.",
		"choices": {
			"1": {
				"text": "Turn to the left and continue walking.",
				"output": "001_wandering_2"
			},
			"2": {
				"text": "Stay on the same path and move forward.",
				"output": "001_wandering_2"
			}
		}
	},
	"001_wandering_2": {
		"title": "",
		"picture": "res://assets/art/Dark_Forest.jpg",
		"narr_text": "The trees feel closer now, their ancient bark like gnarled faces frozen in silent judgment. My name echoes in my mind—Lyaris Alaric Talbot.",
		"choices": {
			"1": {
				"text": "Continue",
				"output": "001_wandering_2_c1"
			}
		}
	},

	"001_wandering_2_c1": {
		"title": "",
		"picture": "res://assets/art/Dark_Forest.jpg",
		"narr_text": "I repeat it under my breath as though it might anchor me. I was an adventurer. No... more than that. soldiers? sellswords? Images blur together—fights won, scars earned, faces forgotten.",
		"choices": {
			"1": {
				"text": "Take a sharp right and keep walking.",
				"output": "001_wandering_3"
			},
			"2": {
				"text": "Continue straight, letting instinct guide you.",
				"output": "001_wandering_3"
			}
		}
	},
	"001_wandering_3": {
		"title": "Wandering: The Forest Speaks",
		"picture": "res://assets/art/Night_Forest.jpg",
		"narr_text": "A distant howl cuts through the night, sending another shiver up my spine. The air smells damp and earthy, with a faint metallic tang I can't place. My hand unconsciously brushes the mark on my wrist. It's warm to the touch, a steady reminder that I am... different now. The memories of betrayal surface again, unbidden. I trusted them... And they left me here to die.",
		"choices": {
			"1": {
				"text": "Pause to listen, then move toward the noise.",
				"output": "001_wandering_4"
			},
			"2": {
				"text": "Veer away from the noise, walking into darker terrain.",
				"output": "001_wandering_4"
			}
		}
	},
	"001_wandering_4": {
		"title": "Wandering: The Endless Forest",
		"picture": "res://assets/art/Night_Forest.jpg",
		"narr_text": "The darkness feels alive, the forest pressing in on all sides. I catch glimpses of movement in the corner of my eye, but when I turn, there’s nothing there. My breath is steady, but my mind races. Who am I really? I can't remember anything beyond the last words I just said. I feel lonely, as though the weight of the question is sinking me into the earth itself.",
		"choices": {
			"1": {
				"text": "Check your belongings for anything useful.",
				"output": "001_remembers_map"
			},
			"2": {
				"text": "Continue walking aimlessly, hoping for direction.",
				"output": "001_remembers_map"
			}
		}
	},
	"001_remembers_map": {
		"title": "Wandering: The Map",
		"picture": "res://assets/art/Crumpled_Map.jpg",
		"narr_text": "My fingers fumble in my pockets until they close around something crumpled and folded. A map. Relief shivers over me as I pull it out, though the paper is crumpled and smudged with dirt. The markings are faint, but they show landmarks—the forest, a river, and a settlement not too far from here. My heart quickens and my breathing feels firmer.",
		"choices": {
			"1": {
				"text": "Head toward the settlement.",
				"output": "001_wolf_attack"
			},
			"2": {
				"text": "Follow the river instead.",
				"output": "001_wolf_attack"
			}
		}
	},
	"001_wolf_attack": {
		"title": "An Unexpected Threat",
		"picture": "res://assets/art/Forest_Wolf.jpg",
		"narr_text": "As you feel some strength return to you move through the forest, your senses prickle with unease. The hair on the back of your neck stands on end as a rustling sound cuts through the otherwise quiet night. Then it happens—a shadow bursts from your right flank, teeth bared and eyes glowing with feral intensity. A wolf. It lunges for your side, jaws snapping.\n\nYou barely manage to twist out of the way, the beast's claws grazing your cloak. Your mind races. You can feel the mark on your wrist pulsing faintly. You know you have the power to summon fire, but at a cost. Alternatively, you could rely on your agility and the dagger you feel strapped to your thigh.\n\nThe wolf snarls and prepares for another strike, circling you like a predator savoring its prey. What will you do?",
		"choices": {
			"1": {
				"text": "Draw power from the mark to summon a fireball and incinerate the wolf.",
				"requirement": {
					"mana": 15
				},
				"buffs": {
					"mana": -4,
					"current_hp": -7,
				},
				"output": "002_draw_power",
				"failed_output": "002_physical_confrontation"
			},
			"2": {
				"text": "Rely on your dagger.",
				"output": "002_physical_confrontation"
			}
		}
	},
	"002_draw_power": {
		"title": "Fire and Fury",
		"picture": "res://assets/art/Flash.jpg",
		"narr_text": "You raise your hand instinctively, the mark flaring to life as heat rushes through your veins. The sensation is almost overwhelming, as the mana courses through your body. A fireball forms in your palm, its light illuminating the wolf's hungry eyes. Without hesitation, you hurl it forward.\n\nThe spell hits the wolf square in the chest, igniting its fur in a burst of flame. \n\nThe creature lets out a pained howl before collapsing in a smoking heap. The forest grows quiet once more, the acrid scent of burnt fur lingering in the air. You feel drained but alive.\n\nYour victory is short-lived, as the exhaustion from channeling the mark’s power starts to creep in.",
		"choices": {
			"1": {
				"text": "Catch your breath and scan the area for other threats.",
				"output": "003_archer_appearance"
			}
		}
	},
	"002_physical_confrontation": {
		"title": "The Harder Way",
		"picture": "res://assets/art/Flash.jpg",
		"narr_text": "Your fingers twitch toward the dagger at your side as the wolf lunges again. You sidestep just in time, the beast’s jaws snapping shut on empty air. With a practiced motion, you draw the blade and pivot, aiming for the wolf’s exposed flank.\n\nYour first strike grazes the creature, drawing blood but not enough to deter it. The wolf spins with frightening speed, teeth flashing dangerously close to your leg. You need to end this quickly.",
		"choices": {
			"1": {
				"text": "Use the mark’s power despite the risk to finish the fight.",
				"requirement": {
					"mana": 10
				},
				"buffs": {
					"mana": -10,
					"current_hp": 1
				},
				"output": "002_draw_power",
				"failed_output": "003_archer_appearance"
			},
			"2": {
				"text": "Dodge again and aim for a killing strike with your dagger.",
				"output": "003_archer_appearance"
			}
		}
	},
	"003_archer_appearance": {
		"title": "An Unexpected Ally",
		"picture": "res://assets/art/Elf_Ranger.jpg",
		"narr_text": "Before you can notice, Another wolf to your flank crouches low, readying itself for another lunge. Time slows as you attempt to react but your chest gives away. as you fall to your knees you look at the wolf with eyes filled with rage refusing the inevitable. Then, the sharp twang of a bowstring cuts through the tension. An arrow flies through the air and buries itself into the wolf’s skull with perfect precision. The beast collapses instantly, lifeless.\n\nYou turn your head and see her. A woman steps out of the shadows, bow in hand and a small, amused smile on her face. Her features are sharp yet friendly from her ears to her form, She hurried over while saying. 'You looked like you could use a hand,' she says casually, lowering her bow.\n\nRelief floods through you, the adrenaline finally fading. You open your mouth to speak, but as your eyes meet exhaustion catches up to you. The last thing you see is her rushing toward you as your vision fades to black.",
		"choices": {
			"1": {
				"text": "Pass out from exhaustion.",
				"output": "004_waking_in_inn"
			}
		}
	},
	"004_waking_in_inn": {
		"title": "A Strange Awakening",
		"picture": "res://assets/art/Inn1.jpg",
		"narr_text": "You wake to the gentle creak of wooden doors and the faint smell of stew wafting through the air. A soft bed cradles your aching body, a stark contrast to the harsh forest floor. your eyes blur open then clear as you see the woman from before is seated across the room, idly polishing her bow.\n\nShe notices you stirring and offers a smile. 'Glad to see you're alive,' she says. 'You’ve got some explaining to do, though.'\n\nHer words are light, but her eyes are sharp, assessing you. You realize your mark was well hidden, The question is, how much do you tell her?",
		"choices": {
			"1": {
				"text": "Thank her and share some of your story.",
				"output": "004_conversation"
			},
			"2": {
				"text": "Remain cautious and share as little as possible.",
				"output": "004_conversation"
			}
		}
	},
	"004_conversation": {
		"title": "A Tense Exchange",
		"picture": "res://assets/art/Inn1.jpg",
		"narr_text": "The archer leans forward, resting her elbows on her knees as she studies you. 'So, you’re not just some lost traveler, are you?' she says, her tone light but her eyes sharp and staring deep into yours. 'That mark of yours... it’s not something you see every day.'\n\nYour arm instinctively tries to hide itself, the mark now barely visible under your sleeve. She caught a glimpse. You’ll need to tread carefully.\n\n'What’s your name?' she asks, tilting her head and sharp, pointed ears. 'And why were you wandering alone in a place crawling with wolves and many monsters?'\n\nYou can feel the weight of her curiosity, but also the undercurrent of caution in her voice.",
		"choices": {
			"1": {
				"text": "Tell her your name and part of the truth about your journey.",
				"output": "005_partial_truth"
			},
			"2": {
				"text": "Deflect her question and ask who she is instead.",
				"output": "005_deflect"
			},
			"3": {
				"text": "Stay silent and observe her reaction.",
				"output": "005_silence"
			}
		}
	},
	"005_partial_truth": {
		"title": "A Fragile Alliance",
		"picture": "res://assets/art/Inn1.jpg",
		"narr_text": "'My name is Lyaris,' you begin cautiously. 'I’ve been... I am...  searching for answers. That mark you saw—it’s tied to something I don’t fully understand yet.'\n\nHer gaze softens slightly. 'Answers, huh? You’re lucky I found you when I did.'\n\nShe leans back, crossing her arms. 'Name’s Kaela, by the way. And you’re safe here, I rented out this inn so you could rest. And now you owe me.'\n\nHer cryptic comment leaves you with more questions than answers. Before you can press her, she stands. 'I have more questions, but first, you need to eat. Rest up. We’ll need to move soon.'",
		"choices": {
			"1": {
				"text": "Thank her and agree to rest.",
				"output": "006_preparing_to_leave"
			},
			"2": {
				"text": "Ask what she meant by ‘not entirely selfless.’",
				"output": "006_selfless_motives"
			}
		}
	},
	"005_deflect": {
		"title": "Turning the Tables",
		"picture": "res://assets/art/inn1.jpg",
		"narr_text": "'Who I am isn’t the important question right now,' you say, your tone even. 'The real question is: who are you? And why were you in the forest with a bow at the ready?'\n\nKaela raises an eyebrow, a faint smile playing on her lips. 'Fair enough. My name’s Kaela, and let’s just say the forest is my home. As for why I was there... let’s just say I had a job nearby. Lucky for you, I have good aim.'\n\nShe stands, stretching her arms over her head. 'Now, if you’re done interrogating me after I saved your life, maybe you can focus on getting something to eat for your own sake.'",
		"choices": {
			"1": {
				"text": "Stay silent.",
				"output": "005_silence"
			},
			"2": {
				"text": "Think about a response.",
				"output": "005_silence"
			}
		}
	},
	"005_silence": {
		"title": "Measured Silence",
		"picture": "res://assets/art/inn1.jpg",
		"narr_text": "You say nothing, your gaze steady as you study her. The silence stretches, but Kaela doesn’t seem perturbed. Instead, she smirks and sits back, crossing one leg over the other.\n\n'Not much of a talker, huh?' she says, her tone teasing. 'That’s fine. Actions speak louder, anyway.'\n\nShe stands, her movements fluid and deliberate. 'You’ve got secrets. I’ve got mine... kind of, Maybe we’ll get along.' Her words carry a hint of amusement, but her eyes stay watchful. This woman is clearly used to danger.",
		"choices": {
			"1": {
				"text": "Nod and let her take the lead.",
				"output": "006_preparing_to_leave"
			},
			"2": {
				"text": "Ask her about her plans for the journey ahead.",
				"output": "006_preparing_to_leave"
			}
		}
	},
	"006_preparing_to_leave": {
		"title": "A New Path",
		"picture": "res://assets/art/Inn_Outside.jpg",
		"narr_text": "After some time passes Kaela retunrs and hands you a small bundle of supplies and gestures toward the door. 'We need to get moving. Overstaying our welcome isn’t safe.'\n\nYou glance at the mark on your wrist, feeling its faint warmth. There’s no telling what dangers lie ahead, but for now, you have an ally. Kaela’s confidence is reassuring, though her motives remain unclear.\n\n.",
		"choices": {
			"1": {
				"text": "Follow Kaela and ask her about her knowledge of the region.",
				"output": "007_new_allies"
			},
			"2": {
				"text": "Stay quiet and focus on the path ahead.",
				"output": "007_new_allies"
			}
		}
	},
	"006_selfless_motives": {
		"title": "Hidden Motives",
		"picture": "res://assets/art/inn_Outside.jpg",
		"narr_text": "'Not entirely selfless?' you ask, narrowing your eyes.\n\nKaela pauses, her gaze sharpening. 'Let’s just say I’m not the kind of person to help out of the goodness of my heart. You’ve got something that might interest me. That mark of yours—it’s rare. Dangerous, too. And it’s drawn attention you’re probably not ready for.'\n\nHer words send a chill down your spine. For now, she seems willing to keep you alive. The question is, at what cost?",
		"choices": {
			"1": {
				"text": "Demand to know what she wants.",
				"output": "007_new_allies"
			},
			"2": {
				"text": "Agree to hear her out later and focus on moving forward.",
				"output": "007_new_allies"
			}
		}
	},
	"007_new_allies": {
		"title": "Into the Forest",
		"picture": "res://assets/art/Kaela_Forest_Sunlight.jpg",
		"narr_text": "Kaela leads the way out of the inn, the late morning sunlight filtering through the tall trees overhead. The area is dense with foliage and beautiful, the air fresh and the earth beneath your feet soft. You notice the occasional glint of light off her armor and the way she moves—careful, yet confident, with a practiced grace. Her dark hair, tied back in a loose ponytail, flutters slightly in the breeze, and her green eyes scan the surroundings, always alert.\n\nYou can feel her gaze occasionally flicking to you, not in an overtly obvious way, but enough that you can tell she’s keeping tabs. Her expression is calm, but there’s an underlying intensity about her. It’s clear she’s seen more than her fair share of danger. You wonder what she does for a living.\n\n'You’re not from around here, are you?' she says after a moment, glancing over her shoulder. 'Terran, right? But you don’t look like the typical kind who wanders too deep into foreign lands. I’d be surprised if you made it out of here alive on your own.' She smirks lightly, but there’s a tinge of genuine concern in her voice.\n\n'Why are you so far from home?'",
		"choices": {
			"1": {
				"text": "Explain that you’re searching for something important.",
				"output": "008_partial_explanation"
			}
		}
	},
	"008_partial_explanation": {
		"title": "A Shared Journey",
		"picture": "res://assets/art/Forest_Walk.jpg",
		"narr_text": "You take a deep breath, choosing your words carefully. 'I’m searching for something—something that might help me understand... who I really am.'\n\nKaela glances back, her green eyes narrowing slightly, but there’s no judgment in her gaze. She seems to understand more than she lets on. 'You don’t have to tell me everything,' she says softly, 'But I’ve been around long enough to know that people rarely travel this far for nothing.'\n\nHer pace slows slightly as you both continue walking. The soft rustle of leaves underfoot and the distant calls of birds create an oddly peaceful atmosphere despite the forest’s danger.\n\n'What is it like back home for you?' she asks suddenly. 'Is it so different from here?' Her voice has a gentle curiosity, and her expression softens as she listens for your response.",
		"choices": {
			"1": {
				"text": " TAVERN Tell her more about your homeland, what makes it unique.",
				"output": "008_kaela_interest"
			}
		}
	},
	"008_kaela_interest": {
		"title": "A Curious Bond",
		"picture": "res://assets/art/Kaela_Staring.jpg",
		"narr_text": "'Terrans don’t come this far. Not many make it past the port,' Kaela says with a thoughtful frown. 'And you don’t seem like the type to just wander without reason.'\n\nShe looks at you for a long moment, her gaze intense yet not unkind. 'I’ve met a few of your kind in the past. Adventurers, explorers... they don’t usually last long. But you seem different. I can’t quite place it.'\n\nShe pauses, letting her words sink in before adding, 'Maybe it’s that look in your eyes. The same one I had when I first ventured out of my country, seeking... something.'\n\nShe smirks lightly, glancing away. 'But you can’t expect me to believe you’re just wandering around aimlessly, can you?'",
		"choices": {
			"1": {
				"text": "Tell her that you’re searching for answers, just like her.",
				"output": "009_shared_journey"
			},
			"2": {
				"text": "Admit that you’re lost, trying to find your way.",
				"output": "009_vulnerable"
			}
		}
	},
	"ddd": {
		"title": "The Hunter's Path",
		"picture": "res://assets/art/Kaela_Hunt_Gear.jpg",
		"narr_text": "'Monster hunting isn’t as glamorous as it sounds,' Kaela says with a soft chuckle. 'It’s not all glory and bounty. Most of the time, it’s just tracking down creatures that would rather eat you than look at you.'\n\nShe pauses for a moment, clearly remembering some past hunts. 'I’ve fought beasts that could tear a man in half with one swipe. And I’ve learned to respect the forest. There’s more here than just trees.'\n\nShe takes a deep breath, then glances over at you. 'But you probably want to know what kind of monsters are lurking around here, don’t you?'",
		"choices": {
			"1": {
				"text": "Ask about the most dangerous creatures she’s encountered.",
				"output": "009_dangerous_creatures"
			},
			"2": {
				"text": "Inquire about how she hunts monsters, the tools she uses.",
				"output": "009_hunting_techniques"
			},
			"3": {
				"text": "Change the topic and ask her what brought her to this forest.",
				"output": "009_why_here"
			},
			"4": {
				"text": "Stay quiet and listen to her recount her experiences.",
				"output": "009_silence"
			}
		}
	},
	"ddwdw": {
		"title": "Unspoken Bonds",
		"picture": "res://assets/art/Kaela_Gazing.jpg",
		"narr_text": "The conversation dwindles into silence, but it’s not uncomfortable. Kaela seems content to walk side by side with you, occasionally glancing at you as if studying your expression.\n\nThe forest around you remains quiet, save for the occasional rustle of branches or distant animal calls. The trees here are older, their trunks thick with age, and the moss that carpets the ground gives off a damp, earthy scent.\n\nKaela doesn’t speak at first, but you can feel her curiosity lingering. Her eyes, dark as night with a subtle gleam of green, flick back to you occasionally.\n\nFinally, she speaks softly. 'You know, Terrans don’t venture this far into others’ lands. It’s dangerous.' She smiles lightly. 'But you don’t seem like the kind to back down easily, do you?'",
		"choices": {
			"1": {
				"text": "TAVERN Confess that you're a little out of your depth, but you can handle it.",
				"output": "010_tavern_intro"
			},
			"2": {
				"text": "Ask her to tell you more about the forest and its dangers.",
				"output": "009_forest_dangers"
			},
			"3": {
				"text": "Admit you're still figuring things out and ask for her guidance.",
				"output": "009_guidance"
			},
			"4": {
				"text": "Stay silent and focus on the path ahead.",
				"output": "009_silence"
			}
		}
	}
}
